BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny212.PIC
        <edc:AdjustPoint edc:_addr="0x60E" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x610" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RES" edc:nzwidth="0x10" ltx:memberofperipheral="ADC0"/>
        <edc:SFRDef edc:_addr="0x612" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINLT" edc:nzwidth="0x10" ltx:memberofperipheral="ADC0"/>
        <edc:SFRDef edc:_addr="0x614" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINHT" edc:nzwidth="0x10" ltx:memberofperipheral="ADC0"/>
        <edc:SFRDef edc:_addr="0x616" edc:access="-------n" edc:cname="CALIB" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="DUTYCYC" edc:desc="Duty Cycle" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DUTY50" edc:desc="50% Duty cycle" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="DUTY25" edc:desc="25% Duty cycle" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x617" edc:offset="0x59"/>
        <edc:SFRDef edc:_addr="0x670" edc:access="nnnnnnnn" edc:cname="CTRLA" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HYSMODE" edc:desc="Hysteresis Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No hysteresis" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="10mV" edc:desc="10mV hysteresis" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="25mV" edc:desc="25mV hysteresis" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="50mV" edc:desc="50mV hysteresis" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LPMODE" edc:desc="Low Power Mode" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Low power mode disabled" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Low power mode enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INTMODE" edc:desc="Interrupt Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="BOTHEDGE" edc:desc="Any Edge" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="NEGEDGE" edc:desc="Negative Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="POSEDGE" edc:desc="Positive Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="OUTEN" edc:desc="Output Buffer Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x671" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x672" edc:access="n--nn-nn" edc:cname="MUXCTRLA" edc:impl="0x9B" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Input MUX Selection" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="Negative Pin 0" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VREF" edc:desc="Voltage Reference" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC output" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Input MUX Selection" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PIN0" edc:desc="Positive Pin 0" edc:when="(field &amp; 0x3) == 0x00"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="INVERT" edc:desc="Invert AC Output" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x673" edc:offset="0x3"/>
        <edc:SFRDef edc:_addr="0x676" edc:access="-------n" edc:cname="INTCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="CMP" edc:desc="Analog Comparator 0 Interrupt Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x677" edc:access="---n---n" edc:cname="STATUS" edc:impl="0x11" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC0">
              <edc:SFRFieldDef edc:cname="CMP" edc:desc="Analog Comparator Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="STATE" edc:desc="Analog Comparator State" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x678" edc:offset="0x8"/>
        <edc:SFRDef edc:_addr="0x680" edc:access="nn-----n" edc:cname="CTRLA" edc:impl="0xC1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DAC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DAC Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="OUTEN" edc:desc="Output Buffer Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby Mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x681" edc:access="nnnnnnnn" edc:cname="DATA" edc:nzwidth="0x8" ltx:memberofperipheral="DAC0"/>
        <edc:AdjustPoint edc:_addr="0x682" edc:offset="0x17E"/>
        <edc:SFRDef edc:_addr="0x800" edc:access="rrrrrrrr" edc:cname="RXDATAL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
              <edc:SFRFieldDef edc:cname="DATA" edc:desc="RX Data" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x801" edc:access="rr---rrr" edc:cname="RXDATAH" edc:impl="0xC7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
              <edc:SFRFieldDef edc:cname="DATA8" edc:desc="Receiver Data Register" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PERR" edc:desc="Parity Error" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="Frame Error" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="BUFOVF" edc:desc="Buffer Overflow" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIF" edc:desc="Receive Complete Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x802" edc:access="nnnnnnnn" edc:cname="TXDATAL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
              <edc:SFRFieldDef edc:cname="DATA" edc:desc="Transmit Data Register" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x803" edc:access="-------n" edc:cname="TXDATAH" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
              <edc:SFRFieldDef edc:cname="DATA8" edc:desc="Transmit Data Register (CHSIZE=9bit)" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x804" edc:access="nnnnn-nn" edc:cname="STATUS" edc:impl="0xFB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="USART0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
              <edc:SFRFieldDef edc:cname="WFB" edc:desc="Wait For Break" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BDF" edc:desc="Break Detected Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ISFIF" edc:desc="Inconsistent Sync Field Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXSIF" edc:desc="Receive Start Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DREIF" edc:desc="Data Register Empty Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="Transmit Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXCIF" edc:desc="Receive Complete Interrupt Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
